app/views/rooms/index.html.erb

SELECT "rooms".* FROM "rooms" ORDER BY "rooms"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "tools".* FROM "tools" WHERE "tools"."room_id" = ? ORDER BY "tools"."id" DESC LIMIT ?  [["room_id", 18], ["LIMIT", 1]]
SELECT 1 AS one FROM "tools" WHERE "tools"."room_id" = ? LIMIT ?  [["room_id", 18], ["LIMIT", 1]]
SELECT "tools".* FROM "tools" WHERE "tools"."room_id" = ? ORDER BY "tools"."id" ASC LIMIT ?  [["room_id", 24], ["LIMIT", 1]]
---
    <p>
        <% if !Room.inventory.tools.empty? %>
            <%= Room.inventory.tools.first.name %>