app/views/rooms/show.html.erb

SELECT "rooms".* FROM "rooms" ORDER BY "rooms"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "tools".* FROM "tools" WHERE "tools"."room_id" = ? ORDER BY "tools"."id" DESC LIMIT ?  [["room_id", 18], ["LIMIT", 1]]
---
        <p>-<%= mess.name %>
        <% if mess.name != "The Room Is Clean" && Room.inventory.tools.first.clean_mess == true %>

SELECT "tools".* FROM "tools" WHERE "tools"."room_id" = ? ORDER BY "tools"."id" ASC LIMIT ?  [["room_id", 30], ["LIMIT", 1]]
---
<h3>Tools in the room</h3>
    <% @room.tools.each do |tool| %>

SELECT 1 AS one FROM "tools" WHERE "tools"."room_id" = ? LIMIT ?  [["room_id", 30], ["LIMIT", 1]]
---
<p>-
<% if !Room.inventory.tools.empty? %>