app/views/rooms/show.html.erb

SELECT "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
>>>>>>> Stashed changes
    <% if Room.inventory.tools.first == mess.tool%>