app/controllers/rooms_controller.rb

    def index
        @rooms = Room.all
---
SELECT "rooms".* FROM "rooms" ORDER BY "rooms"."id" DESC LIMIT ?  [["LIMIT", 1]]

    def show
        @room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

    def drop_button
        @room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

    def pick_up_button
        @room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]