app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        if @user.valid?
            @user.save