app/models/room.rb

SELECT "rooms".* FROM "rooms"
---
    def self.rooms
        Room.all.select{|room| room.name != 'Inventory'}

SELECT "tools".* FROM "tools" WHERE "tools"."room_id" = ?  [["room_id", 30]]
SELECT "tools".* FROM "tools" WHERE "tools"."room_id" = ? ORDER BY "tools"."id" ASC LIMIT ?  [["room_id", 18], ["LIMIT", 1]]
---
    def pick_up(tool_picked)
        tool = Tool.all.find_by_id(tool_picked)
        if Room.inventory.tools.length == 0 && self.tools.length != 0

SELECT "tools".* FROM "tools" WHERE "tools"."room_id" = ? ORDER BY "tools"."id" ASC LIMIT ?  [["room_id", 30], ["LIMIT", 1]]
UPDATE "tools" SET "room_id" = ?, "updated_at" = ? WHERE "tools"."id" = ?  [["room_id", 26], ["updated_at", "2019-10-23 17:55:34.475484"], ["id", 11]]
---
    def drop_item
        self.tools << Room.inventory.tools.first
        Room.inventory.tools.delete
        Room.inventory.save